benchmarks/http_suite_20260323_200209/wrk_ping_io1_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.21ms    2.04ms  60.65ms   78.75%
    Req/Sec     3.15k   584.88    11.39k    88.25%
  Latency Distribution
     50%   10.13ms
     75%   11.23ms
     90%   12.42ms
     99%   16.10ms
  125280 requests in 5.05s, 13.74MB read
Requests/sec:  24805.44
Transfer/sec:      2.72MB